feat: Add swimlane and business entity to Activity Diagram
